### [Panel Data](https://www.tutorialspoint.com/python_pandas/python_pandas_panel.htm)

In [49]:
import pandas as pd
import numpy as np

### Create series with `pd.Series()`
> Data structure for a single column of a DataFrame

In [50]:
dict_data = {'CO': 300, 'MX': 400, 'CH': 200}
dict_data

{'CO': 300, 'MX': 400, 'CH': 200}

In [51]:
pd.Series(dict_data)

CO    300
MX    400
CH    200
dtype: int64

### Create a dataframe (collection os series) with `pd.Dataframe()`

> Two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns)

In [52]:
dict_data = {'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}
dict_data

{'CH': [100, 800, 200], 'CO': [100, 200, 300], 'MX': [300, 500, 400]}

In [53]:
df = pd.DataFrame(dict_data)
df

    CH   CO   MX
0  100  100  300
1  800  200  500
2  200  300  400

### Define index

In [54]:
dict_data = {
    'age' :     [ 10, 9, 13, 14, 12, 11, 12],
    'cm' : [ 115, 110, 130, 155, 125, 120, 125],
    'country' :    [ 'co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
    'genre' :  [ 'F', 'M', 'M', 'M', 'F', 'M', 'F'],
    'Q1' : [ 5, 10, 8, np.nan, 7, 8, 3],
    'Q2' : [ 7, 9, 9, 8, 8, 8, 9.]
}
dict_data

{'age': [10, 9, 13, 14, 12, 11, 12],
 'cm': [115, 110, 130, 155, 125, 120, 125],
 'country': ['co', 'mx', 'co', 'mx', 'mx', 'ch', 'ch'],
 'genre': ['F', 'M', 'M', 'M', 'F', 'M', 'F'],
 'Q1': [5, 10, 8, nan, 7, 8, 3],
 'Q2': [7, 9, 9, 8, 8, 8, 9.0]}

In [55]:
df = pd.DataFrame(dict_data, index = ['ana','benito','camilo','daniel','erika','fabian','gabriela'])
df

          age   cm country genre    Q1   Q2
ana        10  115      co     F   5.0  7.0
benito      9  110      mx     M  10.0  9.0
camilo     13  130      co     M   8.0  9.0
daniel     14  155      mx     M   NaN  8.0
erika      12  125      mx     F   7.0  8.0
fabian     11  120      ch     M   8.0  8.0
gabriela   12  125      ch     F   3.0  9.0

In [56]:
print('Index: ', df.index, '\n')
print('Columns: ', df.columns, '\n')
print('Values: ', df.values)

Index:  Index(['ana', 'benito', 'camilo', 'daniel', 'erika', 'fabian', 'gabriela'], dtype='object')

Columns:  Index(['age', 'cm', 'country', 'genre', 'Q1', 'Q2'], dtype='object')

Values:  [[10 115 'co' 'F' 5.0 7.0]
 [9 110 'mx' 'M' 10.0 9.0]
 [13 130 'co' 'M' 8.0 9.0]
 [14 155 'mx' 'M' nan 8.0]
 [12 125 'mx' 'F' 7.0 8.0]
 [11 120 'ch' 'M' 8.0 8.0]
 [12 125 'ch' 'F' 3.0 9.0]]

---
### Select columns

In [57]:
df['age']

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: age, dtype: int64

In [58]:
df[['age', 'cm', 'genre']]

          age   cm genre
ana        10  115     F
benito      9  110     M
camilo     13  130     M
daniel     14  155     M
erika      12  125     F
fabian     11  120     M
gabriela   12  125     F

---

### Select rows and columns by label/index with `loc()`
#### `df.loc[row_selection, column_selection]`

| row selection | column selection |
| :-- | :-- |
| index/label value: `'ana'` | named column: `'age'` |
| list of labels: `'ana', 'fabian'` | list of column names: `['age', 'country']` |
| logical/boolean index: `df['age'] == 10` | slice of columns: `'age':'genre'` |

In [59]:
df.loc['fabian']

age         11
cm         120
country     ch
genre        M
Q1         8.0
Q2         8.0
Name: fabian, dtype: object

In [60]:
df.loc['ana',['age','cm','Q1']]

age     10
cm     115
Q1     5.0
Name: ana, dtype: object

### Select rows by boolean/conditional lookup with `loc()`

In [61]:
df.loc[df['age'] == 12]

          age   cm country genre   Q1   Q2
erika      12  125      mx     F  7.0  8.0
gabriela   12  125      ch     F  3.0  9.0

In [62]:
df.loc[df['age'] > 12, ['country', 'age']]

       country  age
camilo      co   13
daniel      mx   14

### Set values using `loc()`

In [63]:
df.loc[df['country'] == 'mx', 'nationality'] = 'mexican'
df

          age   cm country genre    Q1   Q2 nationality
ana        10  115      co     F   5.0  7.0         NaN
benito      9  110      mx     M  10.0  9.0     mexican
camilo     13  130      co     M   8.0  9.0         NaN
daniel     14  155      mx     M   NaN  8.0     mexican
erika      12  125      mx     F   7.0  8.0     mexican
fabian     11  120      ch     M   8.0  8.0         NaN
gabriela   12  125      ch     F   3.0  9.0         NaN

---

### Select rows and columns by integer-location based indexing with `iloc()`

#### `df.iloc[row_selection, column_selection]`
- integer list of rows/columns: `[0, 1, 2]`
- slice of rows/columns: `[1:3]`
- single values: `1`

In [64]:
# Result of type Series because only one row selected
print(type(df.iloc[0]))

# First row
df.iloc[0]

<class 'pandas.core.series.Series'>

age             10
cm             115
country         co
genre            F
Q1             5.0
Q2             7.0
nationality    NaN
Name: ana, dtype: object

In [65]:
# Result of type DataFrame because list selection used
print(type(df.iloc[[0]]))

# First row
df.iloc[[0]]

<class 'pandas.core.frame.DataFrame'>

     age   cm country genre   Q1   Q2 nationality
ana   10  115      co     F  5.0  7.0         NaN

In [66]:
# First row, third column
df.iloc[0, 2]

'co'

In [67]:
# First column
df.iloc[:, 0]

ana         10
benito       9
camilo      13
daniel      14
erika       12
fabian      11
gabriela    12
Name: age, dtype: int64

In [68]:
# First three rows
df.iloc[0:3]

        age   cm country genre    Q1   Q2 nationality
ana      10  115      co     F   5.0  7.0         NaN
benito    9  110      mx     M  10.0  9.0     mexican
camilo   13  130      co     M   8.0  9.0         NaN

In [69]:
# First three columns
df.iloc[:, 0:3]

          age   cm country
ana        10  115      co
benito      9  110      mx
camilo     13  130      co
daniel     14  155      mx
erika      12  125      mx
fabian     11  120      ch
gabriela   12  125      ch

In [70]:
df.iloc[-2:, 4:]

           Q1   Q2 nationality
fabian    8.0  8.0         NaN
gabriela  3.0  9.0         NaN

In [71]:
df.iloc[[0, 1, 2],[1, 3]]

         cm genre
ana     115     F
benito  110     M
camilo  130     M

In [86]:
# Each two columns
df.iloc[:, ::2]

          age country    Q1 nationality
ana        10      co   5.0         NaN
benito      9      mx  10.0     mexican
camilo     13      co   8.0         NaN
daniel     14      mx   NaN     mexican
erika      12      mx   7.0     mexican
fabian     11      ch   8.0         NaN
gabriela   12      ch   3.0         NaN

In [72]:
# Each two rows
df.iloc[::2]

          age   cm country genre   Q1   Q2 nationality
ana        10  115      co     F  5.0  7.0         NaN
camilo     13  130      co     M  8.0  9.0         NaN
erika      12  125      mx     F  7.0  8.0     mexican
gabriela   12  125      ch     F  3.0  9.0         NaN

---
### Boolean lookup

In [73]:
df['genre'] == 'M'

ana         False
benito       True
camilo       True
daniel       True
erika       False
fabian       True
gabriela    False
Name: genre, dtype: bool

In [74]:
df.iloc[:, 3] == 'M'

ana         False
benito       True
camilo       True
daniel       True
erika       False
fabian       True
gabriela    False
Name: genre, dtype: bool

In [75]:
df['genre'].str.contains('M')

ana         False
benito       True
camilo       True
daniel       True
erika       False
fabian       True
gabriela    False
Name: genre, dtype: bool

---
### Filter data

In [76]:
df[df['genre'] == 'M']

        age   cm country genre    Q1   Q2 nationality
benito    9  110      mx     M  10.0  9.0     mexican
camilo   13  130      co     M   8.0  9.0         NaN
daniel   14  155      mx     M   NaN  8.0     mexican
fabian   11  120      ch     M   8.0  8.0         NaN

In [77]:
df[df.iloc[:, 3] == 'M']

        age   cm country genre    Q1   Q2 nationality
benito    9  110      mx     M  10.0  9.0     mexican
camilo   13  130      co     M   8.0  9.0         NaN
daniel   14  155      mx     M   NaN  8.0     mexican
fabian   11  120      ch     M   8.0  8.0         NaN

In [78]:
df[df['genre'].str.contains('M')]

        age   cm country genre    Q1   Q2 nationality
benito    9  110      mx     M  10.0  9.0     mexican
camilo   13  130      co     M   8.0  9.0         NaN
daniel   14  155      mx     M   NaN  8.0     mexican
fabian   11  120      ch     M   8.0  8.0         NaN

### Filter data with conditional

In [79]:
df[(df['genre'] == 'M') & (df['country'] == 'co')]

        age   cm country genre   Q1   Q2 nationality
camilo   13  130      co     M  8.0  9.0         NaN

---
### Filter data with `query()` method

In [80]:
df.query('age > 12')

        age   cm country genre   Q1   Q2 nationality
camilo   13  130      co     M  8.0  9.0         NaN
daniel   14  155      mx     M  NaN  8.0     mexican

In [81]:
df.query('age > 12' and 'cm > 130')

        age   cm country genre  Q1   Q2 nationality
daniel   14  155      mx     M NaN  8.0     mexican

In [82]:
df.query('genre.str.contains("M")', engine='python')

        age   cm country genre    Q1   Q2 nationality
benito    9  110      mx     M  10.0  9.0     mexican
camilo   13  130      co     M   8.0  9.0         NaN
daniel   14  155      mx     M   NaN  8.0     mexican
fabian   11  120      ch     M   8.0  8.0         NaN

In [83]:
df.query('cm > 130 and genre.str.contains("M")', engine='python')

        age   cm country genre  Q1   Q2 nationality
daniel   14  155      mx     M NaN  8.0     mexican

In [84]:
df.query('cm > 130 and genre.str.contains("M")', engine='python')['Q2']

daniel    8.0
Name: Q2, dtype: float64

In [85]:
df[df['Q2'] >= df['Q1']]

          age   cm country genre   Q1   Q2 nationality
ana        10  115      co     F  5.0  7.0         NaN
camilo     13  130      co     M  8.0  9.0         NaN
erika      12  125      mx     F  7.0  8.0     mexican
fabian     11  120      ch     M  8.0  8.0         NaN
gabriela   12  125      ch     F  3.0  9.0         NaN

### Bibliography:
- [Pandas iloc and loc](https://www.shanelynn.ie/pandas-iloc-loc-select-rows-and-columns-dataframe/)